MasterCustomSettingXML.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope
    xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
    xmlns="urn:enterprise.soap.sforce.com"
    xmlns:sf="urn:sobject.enterprise.soap.sforce.com">
    <soapenv:Header>
        <SessionHeader>
            <sessionId>SESSION ID REMOVED</sessionId>
        </SessionHeader>
    </soapenv:Header>
    <soapenv:Body>
        <Create>
            <sObjects xsi:type="APT_Apttus_Packages__c">
                <Name>a5T6A000000GqRf</Name>
                <CreatedBy.Id>0056A000001bn0YQAQ</CreatedBy.Id>
                <CreatedBy.Name>Shubham Bhatt</CreatedBy.Name>
                <CreatedDate>2018-02-23T10:12:50.000+0000</CreatedDate>
                <LastModifiedBy.Id>0056A000001bn0YQAQ</LastModifiedBy.Id>
                <LastModifiedBy.Name>Shubham Bhatt</LastModifiedBy.Name>
                <LastModifiedDate>2018-02-23T10:12:50.000+0000</LastModifiedDate>
                <APT_AptContractConfigIntegration__c>9.87</APT_AptContractConfigIntegration__c>
                <APT_ApttusApprovalsManagement__c>8.388</APT_ApttusApprovalsManagement__c>
                <APT_ApttusCPQAdmin__c>2.30</APT_ApttusCPQAdmin__c>
                <APT_ApttusCPQApi__c>9.60</APT_ApttusCPQApi__c>
                <APT_ApttusCPQApprovalsManagement__c>6.67</APT_ApttusCPQApprovalsManagement__c>
                <A1PT_ApttusConfigurationandPricing__c>9.1149</A1PT_ApttusConfigurationandPricing__c>
                <APT_ApttusContractDocuSignIntegration__c>2.28</APT_ApttusContractDocuSignIntegration__c>
                <APT_ApttusContractManagement__c>8.361</APT_ApttusContractManagement__c>
                <APT_ApttusDealMaximizerSetup__c>7.42</APT_ApttusDealMaximizerSetup__c>
                <APT_ApttusDealMaximizer__c>6.6</APT_ApttusDealMaximizer__c>
                <APT_ApttusDocuSignApi__c>3.58</APT_ApttusDocuSignApi__c>
                <APT_ApttusProposalManagement__c>8.135</APT_ApttusProposalManagement__c>
                <APT_ApttusQuoteDocuSignIntegration__c>2.18</APT_ApttusQuoteDocuSignIntegration__c>
                <APT_ApttusQuoteProposalAssetIntegration__c>6.14</APT_ApttusQuoteProposalAssetIntegration__c>
                <APT_ApttusQuoteProposalConfigIntegr__c>9.197</APT_ApttusQuoteProposalConfigIntegr__c>
                <APT_ApttusXAuthorDesignerForExcel__c>1.9</APT_ApttusXAuthorDesignerForExcel__c>
                <APT_ApttusXAuthorForExcel__c>4.40.1</APT_ApttusXAuthorForExcel__c>
                <APT_QuotePropApprovalsManagement__c>6.3</APT_QuotePropApprovalsManagement__c>
            </sObjects>
            <sObjects xsi:type="Apttus_Revenue2__RevenueSystemProperties__c">
                <Name>System Properties</Name>
                <CreatedDate>2018-02-23T10:12:50.000+0000</CreatedDate>
                <LastModifiedBy.Id>0056A000001bn0YQAQ</LastModifiedBy.Id>
                <LastModifiedBy.Name>Shubham Bhatt</LastModifiedBy.Name>
                <LastModifiedDate>2018-02-23T10:12:50.000+0000</LastModifiedDate>
                <Apttus_Revenue2__DefaultScale__c>4</Apttus_Revenue2__DefaultScale__c>
                <Apttus_Revenue2__IgnoreLeapYearForRevenueRecognition__c>true</Apttus_Revenue2__IgnoreLeapYearForRevenueRecognition__c>
                <Apttus_Revenue2__InstanceUrl__c>https://na35.salesforce.com</Apttus_Revenue2__InstanceUrl__c>
                <Apttus_Revenue2__MaxBatchIteratorSize__c>10000</Apttus_Revenue2__MaxBatchIteratorSize__c>
                <Apttus_Revenue2__ProcessRevenueForClosedPeriods__c>true</Apttus_Revenue2__ProcessRevenueForClosedPeriods__c>
                <Apttus_Revenue2__RevenueRecordTypes__c>APTS_Revenue</Apttus_Revenue2__RevenueRecordTypes__c>
            </sObjects>
        </Create>
    </soapenv:Body>
</soapenv:Envelope>